// 25. Найти сумму чисел от 1 до А.

Console.WriteLine("Введите число: ");
int numberA = int.Parse(Console.ReadLine());

