// 5. Написать программу вычисления значения функции y = f(a)

Console.WriteLine("Введите число: ");
int a = int.Parse(Console.ReadLine());
Console.WriteLine("f(a) = a*a");